<?php

namespace Aries\Jeeb\Utils;

class State {
    public function message($id) {
        $message = [
            1   =>  'تراکنش ایجاد شده.',
            2   =>  'هنوز اقدام به پرداخت یا لغو تراکنش نکرده‌اید.',
            3   =>  'تراکنش پرداخت شد، ولی هنوز در بلاکچین تایید نشده.',
            4   =>  'پرداخت تراکنش در بلاکچین تایید شد.',
            5   =>  'پرداخت لغو شده و یا مهلت پرداخت آن به پایان رسیده است.',
            6   =>  'مبلغ پرداخت شده از مبلغ درخواستی کمتر است، به زودی تراکنش مسترد خواهد شد.',
            7   =>  'مبلغ پرداخت شده از مبلغ درخواستی بیشتر است، به زودی تراکنش مسترد خواهد شد.'
        ];


        return $message[$id];

    }
}